#include <stdio.h>
#include <stdlib.h>  // exit(0)とか使�?時に�?要なパッケージ

int main(void){
	int i,j,k,n,l;

	n = 100;

	/* (3) 通し番号 */
	/* l = 0; */  

	for(i =1 ; i <= n; i++){

	/* --------------------------- */

	/* (1) �?の�?つ */
		for(j = 1; j <= n; j++){
			for(k = 1; k <= n; k++){

		/* (2) ダブり防止 */
		/* {
		for(j = i; j <= n; j++){ 
			for(k = j; k <= n; k++) */

			/* --------------------------- */
			
			if((k*k) == (i*i + j*j)){	
			
			/* --------------------------- */
			
			/* (1) �?の�?つ */
				printf("%3d %3d %3d \n",i,j,k);
			}
			
			/* (3) 通し番号 */
			/* {l = l + 1; */
			/*   printf("%3d %3d %3d %3d \n",l,i,j,k);} */

				// exit(0); // 強制終�?する命令(バグ取りするとき便利)

				/* --------------------------- */
				
			}
		}
	}
}
